In [1]:
import numpy as np
import pandas as pd

In [ ]:
inside_index=['class1 class2 class3 class1 class2 class3'.split()]
outside_index=['school1 school1 school1 school2 school2 school2'.split()]
zip_index=list(zip(*outside_index,*inside_index))
multi_index=pd.MultiIndex.from_tuples(zip_index, names=['school','class'])
data=np.random.randint(0,100,size=(6,2))
df=pd.DataFrame(data, index=multi_index, columns=['subject1','subject2'])
df

                subject1  subject2
school1 class1        39        81
        class2        68        18
        class3        17        24
school2 class1        64        26
        class2        21        44
        class3        38        72

In [40]:
df1=pd.DataFrame({"A":[1,2,3,4,5],"B":[5,4,3,2,1],
                  "C":[10,20,30,40,50],
                  "D":[50,40,30,20,10]})
df2=pd.DataFrame({"A":[9,7,6,4,4],"B":[1,4,3,6,1],
                  "C":[10,250,0,40,5],"D":[500,40,3,20,100]})
pd.concat([df1,df2],axis=1)

   A  B   C   D  A  B    C    D
0  1  5  10  50  9  1   10  500
1  2  4  20  40  7  4  250   40
2  3  3  30  30  6  3    0    3
3  4  2  40  20  4  6   40   20
4  5  1  50  10  4  1    5  100